Autodesk.Revit.UI.ExternalDataManagerCommands.BuiltInExternalDataManagerCommands.Unload
Unload external data.

Autodesk.Revit.UI.ExternalDataManagerCommands.BuiltInExternalDataManagerCommands.Show
Show a external data in canvas.

Autodesk.Revit.UI.ExternalDataManagerCommands.BuiltInExternalDataManagerCommands.Remove
Unload external data.

Autodesk.Revit.UI.ExternalDataManagerCommands.BuiltInExternalDataManagerCommands.ReloadFrom
Reload external data from specified location.

Autodesk.Revit.UI.ExternalDataManagerCommands.BuiltInExternalDataManagerCommands.Reload
Remove external data.

Autodesk.Revit.UI.ExternalDataManagerCommands.BuiltInExternalDataManagerCommands.PlaceInstance
Place a external data into Revit model.

Autodesk.Revit.UI.ExternalDataManagerCommands.BuiltInExternalDataManagerCommands.ManageWorksets
Manage workset for external data.

Autodesk.Revit.UI.ExternalDataManagerCommands.BuiltInExternalDataManagerCommands.Import
Import external data into Revit model.

Autodesk.Revit.UI.ExternalDataManagerCommands.BuiltInExternalDataManagerCommands.Add
Add new external data.

Autodesk.Revit.UI.ExternalDataManagerCommands.BuiltInExternalDataManagerCommands
A collection of command ids used in manage links.
Remarks:
This namespace declares the set of command identifiers that are always
available in Revit ("built-in" commands). Each value corresponds to an
entry in the Manage Links dialog or its context menus.
The GUID values are consumed by:
ExternalDataManagerCommand                - Stores metadata such as
localized names/tool-tips for each id.
ExternalDataManagerTool                   - References the ids to
build content tools or right-click menu structures.
IExternalDataManagerServer.onCommand   - Receives the id to
execute the appropriate action on the selected data rows.
Plugin authors should reference these constants rather than inventing
their own when they want to reuse existing Revit UI actions
(e.g. "Reload" or "Unload"). Custom commands, on the other hand, must be
registered with a unique id obtained from 'ExternalDataManagerCommandId'.
Since:
2027